khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
// Copyright 2015-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

/* STM32H5 port. The F1 reference port implements CMD52/CMD53 by hand in
   sdio.c; on H5 stm32h5xx_hal_sdio.c already does that, so this file is only
   the SDMMC1 low level init plus a thin mapping onto the HAL_SDIO API. */

#include <stdio.h>
#include <stdint.h>
#include <stddef.h>

#include "stm32h5xx_hal.h"

#include "sdio_host_log.h"
#include "sdio_host_error.h"
#include "sdio_driver_port.h"
#include "platform_os.h"
#include "sdio.h"

static const char TAG[] = "sdio_driver";

/* Referenced by sdio_host_log.h; raise to 3 for the CCCR dump during bring-up */
int sdio_debugLevel = 3;

SDIO_HandleTypeDef hsdio1;

static volatile uint8_t esp_int_flag;

/* CMD53 byte mode carries a 9-bit count, so a single transfer tops out at 512 */
#define SDIO_PORT_MAX_BYTE_XFER 512U

/* ESP-AT can take several seconds to boot and enable its SDIO slave, while the
   STM32 is ready in milliseconds. SDIO_InitCard() sends CMD5 exactly once, so
   enumeration is retried here instead of losing that race on every boot. */
#define SDIO_INIT_RETRY_COUNT   60U
#define SDIO_INIT_RETRY_MS      500U

/* CCCR Bus Interface Control (function 0, register 0x07) */
#define SDIO_CCCR_BUS_IF_CTRL   0x07U
#define SDIO_CCCR_BUS_WIDTH_MSK 0x03U
#define SDIO_CCCR_BUS_WIDTH_4B  0x02U
#define SDIO_OCR_3V3_WINDOW     0x00FF8000U

/**
  * @brief Slave raised its function-1 interrupt (D1 held low).
  *
  * SDMMC_STA_SDIOIT tracks the D1 level and the HAL does not clear it, so the
  * source has to be masked here or the ISR re-enters until the slave releases
  * D1. sdio_driver_wait_int() re-arms it.
  */
static void EspIoInterruptCallback(SDIO_HandleTypeDef *hsdio, uint32_t func)
{
    (void)func;
    __HAL_SDIO_DISABLE_IT(hsdio, SDMMC_IT_SDIOIT);
    esp_int_flag = 1U;
}

/**
  * @brief Select PLL1Q as the SDMMC1 kernel clock.
  *
  * HAL_RCC_OscConfig() only enables the PLL1 P output, so PLL1Q is still off
  * after SystemClock_Config() and the kernel clock frequency reads back as 0.
  * HAL_RCCEx_PeriphCLKConfig() is what turns PLL1Q on, so it has to run before
  * the frequency is queried - i.e. before HAL_SDIO_Init(), not from MspInit.
  */
static HAL_StatusTypeDef SdioKernelClockConfig(void)
{
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SDMMC1;
    PeriphClkInitStruct.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_PLL1Q;

    return HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
}

void HAL_SDIO_MspInit(SDIO_HandleTypeDef *hsdio)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    if (hsdio->Instance != SDMMC1) {
        return;
    }

    __HAL_RCC_SDMMC1_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    /**SDMMC1 GPIO Configuration
    PB2      ------> SDMMC1_CMD
    PB13     ------> SDMMC1_D0
    PC9      ------> SDMMC1_D1
    PC10     ------> SDMMC1_D2
    PC11     ------> SDMMC1_D3
    PC12     ------> SDMMC1_CK
    */
    GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_13;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = SDIO_PORT_GPIO_SPEED;
    GPIO_InitStruct.Alternate = GPIO_AF12_SDMMC1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(SDMMC1_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(SDMMC1_IRQn);
}

void HAL_SDIO_MspDeInit(SDIO_HandleTypeDef *hsdio)
{
    if (hsdio->Instance != SDMMC1) {
        return;
    }

    __HAL_RCC_SDMMC1_CLK_DISABLE();
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_2 | GPIO_PIN_13);
    HAL_GPIO_DeInit(GPIOC, GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12);
    HAL_NVIC_DisableIRQ(SDMMC1_IRQn);
}

void SdioPortIrqHandler(void)
{
    HAL_SDIO_IRQHandler(&hsdio1);
}

/* R4 carries no CRC and its command-index field is all ones, so a correctly
   framed response always reads back RESPCMD = 0x3F. Any other value means the
   CPSM latched the frame at the wrong bit position. */
#define SDIO_R4_RESPCMD         0x3FU
/* OCR bits 6:0 are reserved and always read 0 in a valid R4 */
#define SDIO_R4_OCR_RSVD_MSK    0x0000007FU

/* Every cell of the probe matrix repeats CMD5 this many times. A link that
   answers some of the time is intermittent - a resistive joint or a marginal
   jumper - which no single-shot test can tell apart from a dead one. */
#define SDIO_PROBE_REPEAT       8U

static const uint32_t sdio_probe_speed[] = {
    GPIO_SPEED_FREQ_VERY_HIGH,
    GPIO_SPEED_FREQ_HIGH,
    GPIO_SPEED_FREQ_MEDIUM,
    GPIO_SPEED_FREQ_LOW,
};
static const char *const sdio_probe_speed_name[] = { "vhigh", "high", "med", "low" };
#define SDIO_PROBE_SPEED_COUNT  (sizeof(sdio_probe_speed) / sizeof(sdio_probe_speed[0]))

/**
  * @brief Re-mux the six SDMMC nets with a different output slew rate.
  */
static void SdioSetPadSpeed(uint32_t speed)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = speed;
    gpio.Alternate = GPIO_AF12_SDMMC1;

    gpio.Pin = GPIO_PIN_2 | GPIO_PIN_13;
    HAL_GPIO_Init(GPIOB, &gpio);
    gpio.Pin = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &gpio);
}

/**
  * @brief Frame-alignment verdict on one R4.
  *
  * The host's shift register always clocks exactly 32 times, so it cannot lose
  * bits: a response that arrives short means the slave advanced its output
  * early, i.e. it saw CK edges the host never issued. RESPCMD says whether the
  * drift had already started by the index field (0x3F = still aligned there),
  * and the trailing reserved ones shifted into the bottom of RESP1 say how many
  * clocks were lost by the end.
  *
  * The NF field is not usable as a verdict - it is one of the first bits to be
  * pushed out, which is why a glitching bus reads as "0 IO functions".
  */
static void SdioReportAlignment(uint32_t resp4, uint32_t respcmd)
{
    uint32_t k;

    if ((respcmd == SDIO_R4_RESPCMD) && ((resp4 & SDIO_R4_OCR_RSVD_MSK) == 0U)) {
        SDIO_LOGE(TAG, "    frame aligned, nf=%lu, OCR=0x%06lx",
                  (unsigned long)((resp4 & 0x70000000U) >> 28U),
                  (unsigned long)(resp4 & 0x00FFFFFFU));
        return;
    }

    for (k = 1U; k < 8U; k++) {
        if (((resp4 & ((1UL << k) - 1UL)) == ((1UL << k) - 1UL)) &&
            (((resp4 >> k) & SDIO_R4_OCR_RSVD_MSK) == 0U)) {
            SDIO_LOGE(TAG, "    slave saw %lu extra CK edge(s) during the "
                           "response (resp = R4<<%lu); OCR=0x%06lx recovered, "
                           "NF lost off the top, index field %s",
                      (unsigned long)k, (unsigned long)k,
                      (unsigned long)((resp4 >> k) & 0x00FFFFFFU),
                      (respcmd == SDIO_R4_RESPCMD) ? "still intact (drift began "
                                                     "in the payload)"
                                                   : "already short (drift began "
                                                     "before the payload)");
            return;
        }
    }
    SDIO_LOGE(TAG, "    corrupt - no single clock count fits the frame");
}

/**
  * @brief One matrix cell: SDIO_PROBE_REPEAT x CMD5 at a fixed slew and CLKDIV.
  */
static void SdioProbeCmd5(uint32_t clkdiv, uint32_t arg, const char *speed_name)
{
    uint32_t i;
    uint32_t resp4 = 0U;
    uint32_t first = 0U;
    uint32_t last = 0U;
    uint32_t respcmd = 0U;
    uint32_t answered = 0U;
    uint32_t varies = 0U;

    MODIFY_REG(hsdio1.Instance->CLKCR, SDMMC_CLKCR_CLKDIV, clkdiv);
    HAL_Delay(2U);
    (void)SDMMC_CmdGoIdleState(hsdio1.Instance);
    HAL_Delay(2U);

