khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    for (i = 0U; i < SDIO_PROBE_REPEAT; i++) {
        resp4 = 0U;
        if (SDMMC_CmdSendOperationcondition(hsdio1.Instance, arg, &resp4) == 0U) {
            if (answered == 0U) {
                first = resp4;
                respcmd = hsdio1.Instance->RESPCMD & 0x3FU;
            } else if (resp4 != first) {
                varies = 1U;
            }
            last = resp4;
            answered++;
        }
        HAL_Delay(1U);
    }

    SDIO_LOGE(TAG, "  pads=%-5s div=%-4lu arg=0x%08lx answered=%lu/%u "
                   "respcmd=0x%02lx resp=0x%08lx",
              speed_name, (unsigned long)clkdiv, (unsigned long)arg,
              (unsigned long)answered, (unsigned int)SDIO_PROBE_REPEAT,
              (unsigned long)respcmd, (unsigned long)first);

    /* With a voltage window in the argument the card leaves busy part way
       through the batch and legitimately answers differently, so a changing
       response is only a fault indication when the argument is 0. */
    if (varies != 0U) {
        SDIO_LOGE(TAG, "    last=0x%08lx - response changed during the batch%s",
                  (unsigned long)last,
                  (arg != 0U) ? " (expected: card leaving busy)"
                              : " (with arg=0 this is a fault - unstable link)");
    }

    if (answered != 0U) {
        SdioReportAlignment(first, respcmd);
    }
}

/**
  * @brief Sweep pad slew rate x bus clock, repeating CMD5 in every cell.
  *
  * Three outcomes are worth separating and none of them is visible from a
  * single CMD5: nothing ever answers (slave silent, or a dead net), some tries
  * answer (intermittent connection - a resistive joint, not a missing one), or
  * every try answers with a shifted frame (bus timing).
  */
#if (SDIO_PORT_ESP_RST_BOOT_MS != 0)
/**
  * @brief Pulse the ESP32-C6 EN pin, then wait for esp-at to come up.
  *
  * Puts the slave in a known state at every host start, which is what makes
  * enumeration repeatable: the software CCCR reset only reaches a slave still
  * willing to decode CMD52, this reaches one that is not.
  */
static void SdioResetSlaveHw(void)
{
    GPIO_InitTypeDef gpio = {0};

    __HAL_RCC_GPIOB_CLK_ENABLE();

    gpio.Pin   = SDIO_PORT_ESP_RST_PIN;
    gpio.Mode  = GPIO_MODE_OUTPUT_OD;
    gpio.Pull  = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(SDIO_PORT_ESP_RST_PORT, &gpio);

    HAL_GPIO_WritePin(SDIO_PORT_ESP_RST_PORT, SDIO_PORT_ESP_RST_PIN, GPIO_PIN_RESET);
    HAL_Delay(SDIO_PORT_ESP_RST_LOW_MS);
    /* Open-drain high is a release, not a drive - the devkit pull-up takes it */
    HAL_GPIO_WritePin(SDIO_PORT_ESP_RST_PORT, SDIO_PORT_ESP_RST_PIN, GPIO_PIN_SET);

    SDIO_LOGI(TAG, "slave held in reset %u ms, waiting %u ms for esp-at",
              (unsigned int)SDIO_PORT_ESP_RST_LOW_MS,
              (unsigned int)SDIO_PORT_ESP_RST_BOOT_MS);
    HAL_Delay(SDIO_PORT_ESP_RST_BOOT_MS);
}
#endif /* SDIO_PORT_ESP_RST_BOOT_MS */

/**
  * @brief CMD52 write of the CCCR RES bit - the only reset an I/O card honours.
  *
  * CMD0 is a memory-card command and an I/O-only slave is free to ignore it, so
  * a host that restarts while the slave keeps running meets a card still holding
  * the RCA and enabled function from the previous session, quietly ignoring
  * CMD5. No amount of retrying breaks that loop; a write of RES to CCCR 0x06
  * does, and it is harmless on a slave that is already idle.
  *
  * The response is deliberately not checked: a wedged slave will not send one,
  * and it acts on the write either way.
  */
static void SdioResetSlaveIo(void)
{
    SDMMC_CmdInitTypeDef cmd = {0};
    uint32_t tickstart;

    if (SDMMC_GetPowerState(hsdio1.Instance) == 0U) {
        return;
    }

    /* R/W=1, function 0, RAW=0, address 0x06 (I/O Abort), data 0x08 (RES) */
    cmd.Argument         = 0x80000C08U;
    cmd.CmdIndex         = SDMMC_CMD_SDMMC_RW_DIRECT;
    cmd.Response         = SDMMC_RESPONSE_SHORT;
    cmd.WaitForInterrupt = SDMMC_WAIT_NO;
    cmd.CPSM             = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(hsdio1.Instance, &cmd);

    tickstart = HAL_GetTick();
    while (((hsdio1.Instance->STA & (SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT |
                                     SDMMC_FLAG_CCRCFAIL)) == 0U) &&
           ((HAL_GetTick() - tickstart) < 10U)) {
    }
    __SDMMC_CLEAR_FLAG(hsdio1.Instance, SDMMC_STATIC_CMD_FLAGS);

    /* The slave needs a moment to fall back to the pre-init state */
    HAL_Delay(20U);
}

/**
  * @brief Does the CPSM actually put a frame on CMD, and does CK really run?
  *
  * Everything else in the probe only says "no response", which cannot tell a
  * silent slave from a host that never transmitted. The AF does not disable the
  * input path, so IDR still shows what the pad is doing: kick a CMD0 off
  * without waiting for it, then sample both pads flat out for longer than the
  * 48-bit frame lasts. CK is the control - it free-runs, so a run of all-high
  * there means the sampling itself is broken.
  */
static void SdioProbeLineActivity(void)
{
    SDMMC_CmdInitTypeDef cmd = {0};
    uint32_t i;
    uint32_t cmd_low = 0U;
    uint32_t ck_low = 0U;

    cmd.Argument         = 0U;
    cmd.CmdIndex         = SDMMC_CMD_GO_IDLE_STATE;
    cmd.Response         = SDMMC_RESPONSE_NO;
    cmd.WaitForInterrupt = SDMMC_WAIT_NO;
    cmd.CPSM             = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(hsdio1.Instance, &cmd);

    /* ~20k reads of two IDRs outlasts a 48-bit frame at 400 kHz by a wide margin */
    for (i = 0U; i < 20000U; i++) {
        if ((GPIOB->IDR & GPIO_PIN_2) == 0U) {
            cmd_low++;
        }
        if ((GPIOC->IDR & GPIO_PIN_12) == 0U) {
            ck_low++;
        }
    }

    __SDMMC_CLEAR_FLAG(hsdio1.Instance, SDMMC_STATIC_CMD_FLAGS);

    SDIO_LOGE(TAG, "probe: line activity during CMD0 - CMD low %lu/%u, "
                   "CK low %lu/%u", (unsigned long)cmd_low, 20000U,
              (unsigned long)ck_low, 20000U);

    if (ck_low == 0U) {
        SDIO_LOGE(TAG, "  CK never sampled low - the clock is not running, so "
                       "nothing below this line means anything");
    } else if (cmd_low == 0U) {
        SDIO_LOGE(TAG, "  CMD never left the pull-up while CK ran - the CPSM is "
                       "not driving PB2, so the slave has nothing to answer");
    } else {
        SDIO_LOGE(TAG, "  host transmits: CK toggles and CMD is pulled low "
                       "inside the frame, so the timeout is at the slave");
    }
}

