khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
        for (j = 0U; j < SDIO_PIN_COUNT; j++) {
            if ((j != i) &&
                (HAL_GPIO_ReadPin(sdio_pins[j].port, sdio_pins[j].pin) == GPIO_PIN_RESET)) {
                SDIO_LOGE(TAG, "  %s shorted to %s", sdio_pins[i].name, sdio_pins[j].name);
            }
        }

        HAL_GPIO_WritePin(sdio_pins[i].port, sdio_pins[i].pin, GPIO_PIN_SET);
        HAL_Delay(2U);
    }

    /* Leave everything as a plain input; HAL_SDIO_MspInit() muxes the AF back on */
    for (i = 0U; i < SDIO_PIN_COUNT; i++) {
        SdioPinMode(&sdio_pins[i], GPIO_MODE_INPUT, GPIO_NOPULL);
    }

    if (stuck != 0U) {
        /* MODER=1/ODR=0/OTYPER=0 in the lines above means the pad really is a
           push-pull output driving low, so only a low impedance path to 3V3 can
           hold the net high - a bridged or mis-wired pull-up, not a 10k one.
           The host cannot assert CMD in this state, which is the CMD5 timeout. */
        SDIO_LOGE(TAG, "pin diag: %lu net(s) tied hard to 3V3 - the host cannot "
                       "drive them at all; rework the pull-ups before blaming "
                       "the slave", (unsigned long)stuck);
    } else if (floating != 0U) {
        SDIO_LOGE(TAG, "pin diag: %lu net(s) floating - fix the wiring before "
                       "reading anything into the CMD5 timeout",
                  (unsigned long)floating);
    } else {
        SDIO_LOGE(TAG, "pin diag: wiring looks sane from the host side");
    }

    return stuck + floating;
}
#endif /* SDIO_PORT_PIN_DIAG */

#if (SDIO_PORT_CK_TOGGLE_MS != 0)
/**
  * @brief Square wave on CK and CMD, slow enough for a meter or logic probe.
  *
  * Proves the host really drives PC12/PB2 and that the far end sees them,
  * which the SDMMC at 400 kHz cannot demonstrate without an analyser.
  */
static void SdioToggleCk(void)
{
    /* One net at a time, so whoever is watching the slave can tell which host
       pin a given ESP32-C6 pad is actually wired to. Expected far end:
       CK->GPIO19, CMD->GPIO18, D0->GPIO20, D1->GPIO21, D2->GPIO22, D3->GPIO23 */
    static const struct {
        const char   *name;
        const char   *far_end;
        GPIO_TypeDef *port;
        uint16_t      pin;
    } sweep[] = {
        { "CK(PC12)",  "GPIO19", GPIOC, GPIO_PIN_12 },
        { "CMD(PB2)",  "GPIO18", GPIOB, GPIO_PIN_2  },
        { "D0(PB13)",  "GPIO20", GPIOB, GPIO_PIN_13 },
        { "D1(PC9)",   "GPIO21", GPIOC, GPIO_PIN_9  },
        { "D2(PC10)",  "GPIO22", GPIOC, GPIO_PIN_10 },
        { "D3(PC11)",  "GPIO23", GPIOC, GPIO_PIN_11 },
    };
    GPIO_InitTypeDef gpio = {0};
    uint32_t i;
    uint32_t end;

    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    gpio.Mode = GPIO_MODE_OUTPUT_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;

    for (i = 0U; i < (sizeof(sweep) / sizeof(sweep[0])); i++) {
        gpio.Pin = sweep[i].pin;
        HAL_GPIO_Init(sweep[i].port, &gpio);
        HAL_GPIO_WritePin(sweep[i].port, sweep[i].pin, GPIO_PIN_SET);

        SDIO_LOGE(TAG, "sweep: %s alone at 2 Hz for %u ms - expect it at "
                       "ESP32-C6 %s", sweep[i].name,
                  (unsigned int)SDIO_PORT_CK_TOGGLE_MS, sweep[i].far_end);

        end = HAL_GetTick() + SDIO_PORT_CK_TOGGLE_MS;
        while (HAL_GetTick() < end) {
            HAL_GPIO_TogglePin(sweep[i].port, sweep[i].pin);
            HAL_Delay(250U);
        }

        /* Release the net (pull-ups take it high) and leave a quiet gap so the
           next window is unambiguous */
        HAL_GPIO_WritePin(sweep[i].port, sweep[i].pin, GPIO_PIN_SET);
        gpio.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(sweep[i].port, &gpio);
        gpio.Mode = GPIO_MODE_OUTPUT_PP;
        HAL_Delay(1500U);
    }
}
#endif /* SDIO_PORT_CK_TOGGLE_MS */

#if (SDIO_PORT_BUS_WIDTH == HAL_SDIO_4_WIRES_MODE)
/**
  * @brief Widen the link to 4 bits once enumeration has completed.
  *
  * HAL_SDIO_Init() compares hsdio->Init.BusWide (an SDMMC_BUS_WIDE_* register
  * value) against HAL_SDIO_4_WIRES_MODE (1), so it always writes 1-bit into
  * CCCR 0x07. Enumeration therefore runs in 1-bit and the switch is done here:
  * CMD52 travels on CMD only, so it is unaffected by the width, and CLKCR is
  * moved to 4-bit only after the slave has acknowledged the new setting.
  */
static sdio_err_t SdioSetBusWidth4(void)
{
    uint8_t val;

    if (sdio_driver_read_byte(0U, SDIO_CCCR_BUS_IF_CTRL, &val) != SDIO_SUCCESS) {
        SDIO_LOGE(TAG, "CCCR 0x07 read failed");
        return FAILURE;
    }

    val = (uint8_t)((val & ~SDIO_CCCR_BUS_WIDTH_MSK) | SDIO_CCCR_BUS_WIDTH_4B);
    if (sdio_driver_write_byte(0U, SDIO_CCCR_BUS_IF_CTRL, val, &val) != SDIO_SUCCESS) {
        SDIO_LOGE(TAG, "CCCR 0x07 write failed");
        return FAILURE;
    }

    if ((val & SDIO_CCCR_BUS_WIDTH_MSK) != SDIO_CCCR_BUS_WIDTH_4B) {
        SDIO_LOGE(TAG, "slave refused 4-bit, CCCR 0x07 = 0x%02x", (unsigned int)val);
        return FAILURE;
    }

    MODIFY_REG(hsdio1.Instance->CLKCR, SDMMC_CLKCR_WIDBUS, SDMMC_BUS_WIDE_4B);
    hsdio1.Init.BusWide = SDMMC_BUS_WIDE_4B;

    SDIO_LOGI(TAG, "bus width switched to 4-bit");
    return SDIO_SUCCESS;
}
#endif /* SDIO_PORT_BUS_WIDTH == HAL_SDIO_4_WIRES_MODE */

sdio_err_t sdio_driver_init(void)
{
    uint32_t kernel_clk;
    uint32_t retry;
    HAL_StatusTypeDef status = HAL_ERROR;

#if (SDIO_PORT_ESP_RST_BOOT_MS != 0)
    /* Before anything touches the bus, so the slave is always freshly booted */
    SdioResetSlaveHw();
#endif

    /* The sweep runs first: it is the only test that says where a wire actually
       lands, and a net the census rejects is exactly when that matters most */
#if (SDIO_PORT_CK_TOGGLE_MS != 0)
    SdioToggleCk();
#endif
#if (SDIO_PORT_PIN_DIAG != 0)
    /* No point clocking the bus when the host cannot even assert CMD */
    if (SdioPinDiag() != 0U) {
        return FAILURE;
    }
#endif

    if (SdioKernelClockConfig() != HAL_OK) {
        SDIO_LOGE(TAG, "SDMMC1 kernel clock config failed");
        return FAILURE;
    }

    kernel_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SDMMC1);
    if (kernel_clk == 0U) {
        SDIO_LOGE(TAG, "SDMMC1 kernel clock is 0");
        return FAILURE;
    }

    hsdio1.Instance = SDMMC1;
    hsdio1.Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;
    hsdio1.Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    /* Enumerate in 1-bit; SdioSetBusWidth4() widens the link afterwards */
    hsdio1.Init.BusWide = SDMMC_BUS_WIDE_1B;
    hsdio1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    /* SDMMC_CK = kernel_clk / (2 * ClockDiv); ClockDiv is 10 bits */
    hsdio1.Init.ClockDiv = kernel_clk / (2U * SDIO_PORT_CLOCK_HZ);
    if (hsdio1.Init.ClockDiv > 0x3FFU) {
        hsdio1.Init.ClockDiv = 0x3FFU;
    }

    SDIO_LOGI(TAG, "[Clock] kernel=%luHz, div=%lu, SDMMC_CK=%luHz",
              (unsigned long)kernel_clk, (unsigned long)hsdio1.Init.ClockDiv,
              (unsigned long)(hsdio1.Init.ClockDiv ? kernel_clk / (2U * hsdio1.Init.ClockDiv)
                                                   : kernel_clk));

    /* Runs the CMD0/CMD5/CMD3/CMD7 enumeration and sets the CCCR bus width.
       A failed attempt leaves State back at RESET, so re-calling it is a clean
       restart of the whole sequence. */
    for (retry = 0U; retry < SDIO_INIT_RETRY_COUNT; retry++) {
        status = HAL_SDIO_Init(&hsdio1);
        if (status == HAL_OK) {
            break;
        }
        SdioResetSlaveIo();
        HAL_Delay(SDIO_INIT_RETRY_MS);
    }

    if (status != HAL_OK) {
        /* SDIO_InitCard() returns HAL_ERROR without recording an ErrorCode, so
           re-probe CMD0/CMD5 here to say which half of the link is at fault. */
        SDIO_LOGE(TAG, "HAL_SDIO_Init failed after %lu attempts, err=0x%08lx",
                  (unsigned long)SDIO_INIT_RETRY_COUNT,
                  (unsigned long)HAL_SDIO_GetError(&hsdio1));
        SdioProbeSlave();
        return FAILURE;
    }

